run/disc/case0/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	outlet
    {
        type            fixedValue;
        value           $internalField;
    }
    bottom
    {
        type            symmetry;
    }
    right
    {
        type            symmetry;
    }
    top
    {
        type            zeroGradient;
    }
    left
    {
        type            symmetry;
    }
    inlet
    {
        type            zeroGradient;
    }
    disc
    {
        type            zeroGradient;
    }    
}


// ************************************************************************* //
