run/disc/case0/system/caseParameters
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

// Case parameters
l		1600;
h		-400;

// domain size
x0			#eval{ 0.5*$l };
y0			$h;
z0			#eval{ 0 };

x1			#eval{ -0.5*$l };
y1			0;
z1			#eval{ 0.5*$l };

nx			64;
nz			32;
ny			16;


// ************************************************************************* //
