run/disc/case0/system/controlDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleRheoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         ENDTIME;

deltaT          1e-06;

writeControl    adjustable;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo          1e-02;

maxDeltaT	   1e-03;

functions
{
	forces
    {
        type            rheoForces;
        libs            ("libiRheoFoamPostProcess.so");
        writeControl    writeTime;
        writefields		true;
        patches         (disc);
        areaPatches		(disc);
        calcBulkForce	true;
    }
}


// ************************************************************************* //
