run/disc/case0/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default			backward;
}

gradSchemes
{
    default			Gauss linear;
}

divSchemes
{
    default			Gauss linear;
}

laplacianSchemes
{
    default			Gauss linear corrected;
}

interpolationSchemes
{
    default			linear;
}

snGradSchemes
{
    default			corrected;
}


// ************************************************************************* //
