run/disc/case0/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
disc.stl
{
    extractionMethod     extractFromSurface;

	includedAngle        150;

	geometricTestOnly    yes;

	subsetFeatures
	{
    	nonManifoldEdges yes;
    	openEdges        yes;
	}

	trimFeatures
	{
    	minElem          0;
    	minLen           0;
	}

	writeObj             no;
}



// ************************************************************************* //
